def generate_table_time_file(file_name_data,year_selected,month_selected):
    """ Функция геренации файла табеля. Принимает: file_name -  имя файла данных c считывателя,
        year_selected - указание года, в котором месяц, для которого строится табель, month_selected - указание месяца, по которому нужно построить табель
        Возвращает 0, печатает сообщение, что файл успешно сгенерирован.
    """
    pass
    print('Файл успешно сгенерирован!')

def build_excel_file(A,name_file_excel):
    """ Функция формирует excel файл. 
        Принимает словарь А, который содержит информацию о работниках, и времени отметки
    """
    pass